{
  "Block": "Blok",
  "Balance": "Bakiye",
  "Connect": "Bağlan",
  "Unexpected Error": "Beklenmeyen Hata",
  "An error has occured during the wallet status check.": "Cüzdan durumu kontrolü sırasında bir hata oluştu",
  "Please try again later.": "Lütfen daha sonra tekrar deneyin.",
  "The error code was:": "Hata kodu:",
  "Wallet Is Locked": "Cüzdan Kilitli",
  "Please unlock your wallet if you want to continue.": "Lütfen devam etmek için cüzdanınızın kilidini açın.",
  "Unlock Wallet": "Cüzdanın Kilidini Aç",
  "An error has occured during the unlock wallet check.": "Cüzdan kilidi kontrolü sırasında bir hata oluştu.",
  "Unlock Rejected": "Kilit Açma İsteği Reddedildi",
  "You rejected the unlock wallet request.": "Cüzdan kilidi açma isteğini reddettiniz",
  "Please try again if you want to continue.": "Devam etmek istiyorsanız tekrar deneyin.",
  "Unlock Requested": "Kilit Açma İsteği Gönderildi",
  "Waiting for the unlock wallet request to be accepted.": "Cüzdan kilidini açmanız bekleniyor.",
  "Please check your Web3 wallet.": "Lütfen Web3 cüzdanınızı kontrol edin.",
  "Waiting Unlock": "Kilidin açılması bekleniyor",
  "You haven't unlocked your wallet yet.": "Henüz cüzdan kilidini açmadınız.",
  "Please close this dialog, open your Web3 wallet, unlock it, and click connect button again.": "Lütfen bu dialog'u kapatın, Web3 cüzdanınızı gidip kilidini açın ve tekrar bağlan butonuna tıklayın",
  "An error has occured during the network check.": "Ağ kontrolü sırasında bir hata oluştu.",
  "An error has occured during the network switch request.": "Ağ değiştirme isteği sırasında bir hata oluştu.",
  "Switch Rejected": "Ağ Değiştirme İsteği Reddedildi",
  "You rejected the network switch request.": "Ağ değiştirme isteğini reddettiniz.",
  "Network Switch Requested": "Ağ Değiştirme İsteği Gönderildi",
  "Waiting for the network switch request to be accepted.": "Ağ değiştirme isteğini kabul etmeniz bekleniyor.",
  "Switch Network": "Ağ Değiştir",
  "Wrong Network": "Yanlış Ağ",
  "Current network is not supported by this app.": "Bağlı olduğunuz ağ bu uygulama tarafından desteklenmemektedir.",
  "If you want to continue, please switch to any supported network.": "Devam etmek istiyorsanız lütfen desteklenen ağlardan birini seçin.",
  "Sign Required": "İmza Gerekli",
  "In order to use this app, you need to sign the login request in your wallet.": "Bu uygulamayı kullanmak için, giriş isteğinizi cüzdanınızla imzalamanız gerekir.",
  "SIGN_MESSAGE": "Harika Merkeziyetsiz Uygulamam'dan merhaba!\nBu cüzdana erişiminiz olduğunu kanıtlamak için bu mesajı imzalayın, ben de oturumunuzu açayım.\nBu size herhangi bir jetona mal olmayacak.\nBilgisayar korsanlarının cüzdanınızı kullanmasını durdurmak için işte tahmin edemeyecekleri benzersiz bir mesaj kimliği:\n",
  "Sign In": "Giriş Yap",
  "Cancel": "İptal",
  "Signed In": "Giriş Yapıldı",
  "You have successfully signed the login request.": "Giriş isteğini başarılı bir şekilde imzaladınız.",
  "Redirecting to app...": "Uygulamaya yönleniliyor...",
  "An error has occured during the sign check.": "İmza kontrolü sırasında bir hata oluştu.",
  "Preparing Sign Request": "İmzalanacak mesaj hazırlanıyor.",
  "Sign Rejected": "İmza Reddedildi",
  "You rejected the sign request.": "İmza isteğini reddettiniz.",
  "Waiting Signature": "İmza Bekleniyor",
  "Waiting for the login request to be signed.": "Giriş isteğinin imzalanması bekleniyor.",
  "Sign Timed Out": "İmza Süresi Doldu",
  "You didn't respond to the sign request in time.": "Giriş isteğini izin verilen sürede imzalamadınız.",
  "Load Account": "Hesabı Yükle",
  "Your wallet account connected successfuly.": "Cüzdan hesabınız başarıyla yüklendi.",
  "Why On Earth I'd Sign With My Wallet? Is it safe?": "Cüzdanımla Neden İmzalamalıyım? Güvenli mi?",
  "Why Sign Needed? Is it Safe?": "Neden İmza Gerekli? Güvenli mi?",
  "Why Personal Sign? Ensuring Your Security": "Neden Personal Sign? Güvenliğinizi Sağlamak",
  "Connecting your Web3 wallet? You'll encounter a request for personal sign-in. It's different from eth sign and designed for your safety.": "Web3 cüzdanınızı bağlıyor musunuz? Personal sign isteğiyle karşılaşacaksınız. Bu eth sign'dan farklıdır ve güvenliğiniz için tasarlanmıştır.",
  "Personal Sign: Safe and Secure": "Personal Sign: Güvenli ve Emniyetli",
  "Personal sign verifies your wallet without enabling transactions—entirely secure, no risk to your funds. We use it solely to confirm wallet authenticity.": "Personal sign, işlem yapılmasına izin vermeden cüzdanınızı doğrular—tamamen güvenli, fonlarınıza hiçbir risk yoktur. Bunu sadece cüzdan özgünlüğünü doğrulamak için kullanırız.",
  "Eth Sign: Beware of Risks": "Eth Sign: Risklere Dikkat",
  "Eth sign is risky, allowing external access to drain your wallet. We don't request it—avoid signing eth requests on unfamiliar sites to protect your assets.": "Eth sign risklidir ve dış erişime cüzdanınızı boşaltma izni verebilir. Biz bunu talep etmiyoruz—varlıklarınızı korumak için tanımadığınız sitelerde eth sign isteklerini imzalamaktan kaçının.",
  "More Info": "Daha Fazla Bilgi",
  "Detecting wallets": "Cüzdanlar algılanıyor",
  "Detecting installed Web3 wallets.": "Yüklenmiş Web3 cüzdanları algılanıyor.",
  "Detection Failed": "Cüzdan Algılama Hatası",
  "Web3 wallet detection failed.": "Web3 cüzdanı algılaması başarısız.",
  "An error has occured during the wallet extension check.": "Cüzdan eklentisi kontrolü sırasında bir hata oluştu.",
  "No Web3 Wallet Detected": "Web3 Cüzdanı Bulunamadı",
  "Please install any compatible Web3 wallet extension for your browser from the official links below and try again to use this dapp.": "Lütfen aşağıdaki resmi bağlantılardan tarayıcınız için uyumlu herhangi bir Web3 cüzdan uzantısını yükleyin ve bu uygulamayı kullanmayı tekrar deneyin.",
  "Wallet": "Cüzdan",
  "Link": "Bağlantı",
  "Install": "Yükle",
  "Multiple Web3 Wallet Detected": "Birden Fazla Cüzdan Algılandı",
  "The following Web3 wallet extensions dedected in your browser. You can select the wallet you want to connect.": "Aşağıdaki Web3 cüzdanları algılandı. Bağlanmak istediğiniz cüzdanı seçebilirsiniz.",
  "Select": "Seç",
  "Check Web3 Wallet Extension": "Web3 Cüzdanı Eklentisi Kontrolü",
  "A supported Web3 wallet extension needs to be installed.": "Desteklenen bir Web3 cüzdanı eklentisi yüklü olmalıdır.",
  "Check Web3 Wallet Status": "Web3 Cüzdanı Durum Kontrolü",
  "The Web3 wallet needs to be unlocked.": "Web3 cüzdanının kilidi açık olmalıdır",
  "Check Web3 Wallet Network": "Web3 Cüzdanı Ağ Kontrolü",
  "A supported network needs to be selected in the Web3 wallet.": "Web3 cüzdanınızda desteklenen bir ağ seçilmiş olmalıdır",
  "Load Web3 Wallet Account": "Web3 Cüzdanı Hesabını Yükle",
  "Check Web3 Wallet Signature": "Web3 Cüzdanı İmza Kontrolü",
  "The login request needs to be signed in the Web3 wallet.": "Giriş isteği Web3 cüzdanında imzalanmalıdır",
  "Connecting to Web3 Wallet": "Web3 Cüzdanına Bağlanılıyor",
  "My Profile": "Profilim",
  "Copy Address": "Adresi Kopyala",
  "View on Explorer": "Ağ Gezgininde Görüntüle",
  "Disconnect": "Bağlantıyı kes",
  "Address copied.": "Adres kopyalandı",
  "The address of your account has been copied to the clipboard.": "Cüzdan adresiniz panoya kopyalandı.",
  "User Dashboard": "Kullanıcı Panosu",
  "As an example, you can put current user's latest transactions here...": "Örnek olarak, mevcut kullanıcının son işlemlerini buraya koyabilirsiniz...",
  "401 Unauthorized": "401 Yetki Hatası",
  "This page requires a Web3 wallet connection to access.": "Bu sayfaya erişmek için Web3 cüzdan bağlantısı gereklidir.",
  "To access this page, you need to:": "Bu sayfaya erişmek için şunları yapmanız gerekir:",
  "Click the \"Connect\" button below or in the header": "Aşağıdaki veya başlıktaki \"Bağlan\" düğmesine tıklayın",
  "Choose your Web3 wallet (MetaMask, Coinbase, Core, or Rabby)": "Web3 cüzdanınızı seçin (MetaMask, Coinbase, Core veya Rabby)",
  "Approve the connection request in your wallet": "Cüzdanınızdaki bağlantı isteğini onaylayın",
  "Sign the login message to verify your wallet ownership": "Cüzdan sahipliğinizi doğrulamak için giriş mesajını imzalayın",
  "You will be automatically redirected back to this page": "Otomatik olarak bu sayfaya yönlendirileceksiniz",
  "Your wallet connection is secure and you can disconnect anytime.": "Cüzdan bağlantınız güvenlidir ve istediğiniz zaman bağlantıyı kesebilirsiniz."
}
